app/controllers/pages_controller.rb

  def home
    @notifications = Notification.all
---
SELECT "notifications".* FROM "notifications"

  def mark_alerts_read
    Notification.all.where(seen: false).update_all(seen: true)
---
UPDATE "notifications" SET "seen" = 1 WHERE "notifications"."seen" = ?  [["seen", 0]]